package ex3;

import java.io.IOException;

/**
 * Інтерфейс для об'єктів, що відповідають за відображення результатів.
 * <p>
 * Забезпечує методи для відображення, ініціалізації, збереження та відновлення даних.
 * Кожен метод має конкретне призначення для роботи з результатами.
 * </p>
 * 
 * @author xone
 * @version 1.0
 */
public interface View {
    /**
     * Виводить заголовок результатів.
     * <p>
     * Використовується для відображення вступної інформації перед основними результатами.
     * </p>
     */
    public void viewHeader();

    /**
     * Виводить основні результати.
     * <p>
     * Використовується для відображення основного змісту результатів.
     * </p>
     */
    public void viewBody();

    /**
     * Виводить закінчення результатів.
     * <p>
     * Використовується для відображення завершальної інформації після основних результатів.
     * </p>
     */
    public void viewFooter();

    /**
     * Виводить всі результати.
     * <p>
     * Викликає методи {@link #viewHeader()}, {@link #viewBody()} та {@link #viewFooter()}
     * для відображення повного набору результатів.
     * </p>
     */
    public void viewShow();

    /**
     * Ініціалізує дані.
     * <p>
     * Використовується для підготовки даних перед їх відображенням.
     * </p>
     */
    public void viewInit();

    /**
     * Зберігає дані для подальшого відновлення.
     * 
     * @throws IOException Якщо виникає помилка під час збереження даних.
     */
    public void viewSave() throws IOException;

    /**
     * Відновлює збережені дані.
     * 
     * @throws Exception Якщо виникає помилка під час відновлення даних.
     */
    public void viewRestore() throws Exception;
}

